# Ejercicios en Pypsark y SQL

In [1]:
import pyspark
from pyspark.sql import SparkSession
import pyspark.sql.functions as F
from pyspark.sql.window import Window

In [2]:
spark = SparkSession.builder.getOrCreate()

Ejercicio 1: Cargar Datos desde CSV y Parquet
Carga los datos desde los archivos data.csv y data.parquet en DataFrames de PySpark.
Muestra las primeras 10 filas de cada DataFrame.

In [3]:
csv = spark.read.csv("./data/data.csv", header=True, inferSchema=True)
csv.show(10)

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  2|Charlie| 35|    Houston| 90582|
|  3|    Bob| 28|    Chicago| 82072|
|  4|  David| 21|Los Angeles| 52764|
|  5|    Bob| 53|   New York| 63448|
|  6|    Bob| 50|    Chicago| 70690|
|  7|  Alice| 20|   New York| 73682|
|  8|  David| 33|    Houston| 88183|
|  9|Charlie| 26|    Houston| 42488|
| 10|  David| 34|    Chicago| 87400|
+---+-------+---+-----------+------+
only showing top 10 rows

In [4]:
parquet = spark.read.parquet("./data/data.parquet", header=True, inferSchema=True)
parquet.show(10)

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  2|Charlie| 35|    Houston| 90582|
|  3|    Bob| 28|    Chicago| 82072|
|  4|  David| 21|Los Angeles| 52764|
|  5|    Bob| 53|   New York| 63448|
|  6|    Bob| 50|    Chicago| 70690|
|  7|  Alice| 20|   New York| 73682|
|  8|  David| 33|    Houston| 88183|
|  9|Charlie| 26|    Houston| 42488|
| 10|  David| 34|    Chicago| 87400|
+---+-------+---+-----------+------+
only showing top 10 rows

Ejercicio 2: Filtrado de Datos
Filtra los registros donde la edad es mayor a 40.
Realiza el mismo filtrado utilizando SQL.

In [5]:
csv.filter(F.col("age")>40).show()

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  5|    Bob| 53|   New York| 63448|
|  6|    Bob| 50|    Chicago| 70690|
| 11|  Alice| 57|    Chicago| 69692|
| 12|  Alice| 44|Los Angeles| 52611|
| 13|    Bob| 53|    Houston| 69018|
| 14|  David| 57|    Chicago| 66389|
| 17|  Alice| 52|    Chicago| 31275|
| 18|    Bob| 44|   New York| 56190|
| 19|    Bob| 48|Los Angeles| 51606|
| 20|Charlie| 56|    Chicago| 89405|
| 21|  Alice| 54|    Chicago| 85145|
| 22|    Bob| 52|   New York| 56649|
| 23|    Bob| 54|Los Angeles| 33301|
| 24|Charlie| 44|Los Angeles| 94318|
| 27|  Alice| 54|Los Angeles| 79076|
| 30|  David| 47|    Chicago| 64246|
| 34|    Bob| 48|   New York| 37439|
| 39|Charlie| 50|   New York| 94475|
| 41|  David| 44|    Chicago| 82277|
+---+-------+---+-----------+------+
only showing top 20 rows

In [6]:
csv.createOrReplaceTempView("personas")
filtrado_sql = spark.sql("SELECT * FROM personas WHERE age>40")
filtrado_sql.show()

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  5|    Bob| 53|   New York| 63448|
|  6|    Bob| 50|    Chicago| 70690|
| 11|  Alice| 57|    Chicago| 69692|
| 12|  Alice| 44|Los Angeles| 52611|
| 13|    Bob| 53|    Houston| 69018|
| 14|  David| 57|    Chicago| 66389|
| 17|  Alice| 52|    Chicago| 31275|
| 18|    Bob| 44|   New York| 56190|
| 19|    Bob| 48|Los Angeles| 51606|
| 20|Charlie| 56|    Chicago| 89405|
| 21|  Alice| 54|    Chicago| 85145|
| 22|    Bob| 52|   New York| 56649|
| 23|    Bob| 54|Los Angeles| 33301|
| 24|Charlie| 44|Los Angeles| 94318|
| 27|  Alice| 54|Los Angeles| 79076|
| 30|  David| 47|    Chicago| 64246|
| 34|    Bob| 48|   New York| 37439|
| 39|Charlie| 50|   New York| 94475|
| 41|  David| 44|    Chicago| 82277|
+---+-------+---+-----------+------+
only showing top 20 rows

Ejercicio 3: Agregaci贸n
Calcula el salario promedio por ciudad.
Realiza la misma agregaci贸n utilizando SQL.

In [7]:
csv.groupBy("city").avg("salary").show()

+-----------+------------------+
|       city|       avg(salary)|
+-----------+------------------+
|Los Angeles|65268.515724027275|
|    Chicago|  64844.2011753888|
|    Houston|   64969.999360716|
|   New York| 65033.62515482041|
+-----------+------------------+

In [8]:
ciudades_sql = spark.sql("SELECT city, AVG(salary) as prom_salary FROM personas GROUP BY city")
ciudades_sql.show()

+-----------+------------------+
|       city|       prom_salary|
+-----------+------------------+
|Los Angeles|65268.515724027275|
|    Chicago|  64844.2011753888|
|    Houston|   64969.999360716|
|   New York| 65033.62515482041|
+-----------+------------------+

Ejercicio 4: Agrupaci贸n Compleja
Calcula el salario promedio y la edad promedio por ciudad y nombre.
Realiza la misma operaci贸n utilizando SQL.

In [9]:
promedios = csv.groupBy("city", "name").agg(F.avg("salary"), F.avg("age"))
promedios.show()

+-----------+-------+------------------+------------------+
|       city|   name|       avg(salary)|          avg(age)|
+-----------+-------+------------------+------------------+
|Los Angeles|  David|65390.802979336855| 39.58753804260772|
|    Houston|Charlie| 65104.80758764207|39.279654234032336|
|    Houston|  David|64892.271529411766| 39.36313725490196|
|Los Angeles|  Alice| 65469.02425614489|39.364003880983184|
|   New York|    Bob|64843.845139771285| 39.66073697585769|
|Los Angeles|    Bob| 65006.71658179504| 39.52514322087842|
|    Chicago|Charlie|  65236.3021777142|  39.4619297408997|
|   New York|  Alice| 65010.17736087025|39.674286615166324|
|Los Angeles|Charlie| 65210.91188293938| 39.26161762341212|
|    Houston|    Bob| 64790.22002571521|39.518161362905815|
|   New York|Charlie|65102.253031269945| 39.62188895979579|
|    Chicago|  Alice| 64933.36254728878| 39.55343631778058|
|    Chicago|  David| 64636.90771460783|39.432436785311644|
|   New York|  David| 65182.82881411303| 39.47958183600131|
|    Houston|  Alice|  65094.8303686934| 39.48415265200517|
|    Chicago|    Bob| 64561.29275409305|39.548062895120765|
+-----------+-------+------------------+------------------+

In [10]:
promedios_sql = spark.sql("SELECT city, name, avg(salary), avg(age) FROM personas GROUP BY city, name")
promedios_sql.show()

+-----------+-------+------------------+------------------+
|       city|   name|       avg(salary)|          avg(age)|
+-----------+-------+------------------+------------------+
|Los Angeles|  David|65390.802979336855| 39.58753804260772|
|    Houston|Charlie| 65104.80758764207|39.279654234032336|
|    Houston|  David|64892.271529411766| 39.36313725490196|
|Los Angeles|  Alice| 65469.02425614489|39.364003880983184|
|   New York|    Bob|64843.845139771285| 39.66073697585769|
|Los Angeles|    Bob| 65006.71658179504| 39.52514322087842|
|    Chicago|Charlie|  65236.3021777142|  39.4619297408997|
|   New York|  Alice| 65010.17736087025|39.674286615166324|
|Los Angeles|Charlie| 65210.91188293938| 39.26161762341212|
|    Houston|    Bob| 64790.22002571521|39.518161362905815|
|   New York|Charlie|65102.253031269945| 39.62188895979579|
|    Chicago|  Alice| 64933.36254728878| 39.55343631778058|
|    Chicago|  David| 64636.90771460783|39.432436785311644|
|   New York|  David| 65182.82881411303| 39.47958183600131|
|    Houston|  Alice|  65094.8303686934| 39.48415265200517|
|    Chicago|    Bob| 64561.29275409305|39.548062895120765|
+-----------+-------+------------------+------------------+

Ejercicio 5: Ordenaci贸n de Datos
Ordena los datos por salario de forma descendente.
Realiza la misma operaci贸n utilizando SQL.

In [11]:
salarios = csv.orderBy(F.desc("salary"))
salarios.show()

+-----+-------+---+-----------+------+
|   id|   name|age|       city|salary|
+-----+-------+---+-----------+------+
|16169|Charlie| 35|    Chicago| 99998|
| 9272|Charlie| 43|Los Angeles| 99997|
|39554|  Alice| 31|Los Angeles| 99996|
| 6889|    Bob| 26|    Chicago| 99995|
|90318|  David| 20|Los Angeles| 99994|
|59843|  David| 33|Los Angeles| 99992|
|61997|Charlie| 22|    Chicago| 99992|
|23172|    Bob| 54|    Chicago| 99991|
|59778|Charlie| 55|    Houston| 99989|
|41326|  David| 56|Los Angeles| 99989|
|59801|  David| 57|Los Angeles| 99988|
|90390|    Bob| 57|    Chicago| 99988|
|14369|    Bob| 59|   New York| 99987|
|47650|Charlie| 58|    Chicago| 99987|
|56057|  Alice| 38|    Chicago| 99986|
|37067|  David| 48|   New York| 99985|
|55763|  Alice| 48|Los Angeles| 99985|
| 7716|  David| 31|    Chicago| 99983|
|25805|Charlie| 47|    Houston| 99983|
|41636|  David| 28|   New York| 99983|
+-----+-------+---+-----------+------+
only showing top 20 rows

In [12]:
salarios_sql = spark.sql("SELECT * FROM personas ORDER BY salary desc")
salarios_sql.show()

+-----+-------+---+-----------+------+
|   id|   name|age|       city|salary|
+-----+-------+---+-----------+------+
|16169|Charlie| 35|    Chicago| 99998|
| 9272|Charlie| 43|Los Angeles| 99997|
|39554|  Alice| 31|Los Angeles| 99996|
| 6889|    Bob| 26|    Chicago| 99995|
|90318|  David| 20|Los Angeles| 99994|
|59843|  David| 33|Los Angeles| 99992|
|61997|Charlie| 22|    Chicago| 99992|
|23172|    Bob| 54|    Chicago| 99991|
|59778|Charlie| 55|    Houston| 99989|
|41326|  David| 56|Los Angeles| 99989|
|59801|  David| 57|Los Angeles| 99988|
|90390|    Bob| 57|    Chicago| 99988|
|14369|    Bob| 59|   New York| 99987|
|47650|Charlie| 58|    Chicago| 99987|
|56057|  Alice| 38|    Chicago| 99986|
|37067|  David| 48|   New York| 99985|
|55763|  Alice| 48|Los Angeles| 99985|
| 7716|  David| 31|    Chicago| 99983|
|25805|Charlie| 47|    Houston| 99983|
|41636|  David| 28|   New York| 99983|
+-----+-------+---+-----------+------+
only showing top 20 rows

Ejercicio 6: Creaci贸n de Nuevas Columnas
Crea una nueva columna llamada salary_range que clasifique los salarios en rangos: "Low", "Medium", "High".
Realiza lo mismo utilizando SQL.

In [13]:
salary_range = csv.withColumn("salary_range", F.when(F.col("salary")<50000, "Low").when(F.col("salary").between(50000, 75000), "Medium").otherwise("High"))
salary_range.show()

+---+-------+---+-----------+------+------------+
| id|   name|age|       city|salary|salary_range|
+---+-------+---+-----------+------+------------+
|  1|  Alice| 45|Los Angeles| 98205|        High|
|  2|Charlie| 35|    Houston| 90582|        High|
|  3|    Bob| 28|    Chicago| 82072|        High|
|  4|  David| 21|Los Angeles| 52764|      Medium|
|  5|    Bob| 53|   New York| 63448|      Medium|
|  6|    Bob| 50|    Chicago| 70690|      Medium|
|  7|  Alice| 20|   New York| 73682|      Medium|
|  8|  David| 33|    Houston| 88183|        High|
|  9|Charlie| 26|    Houston| 42488|         Low|
| 10|  David| 34|    Chicago| 87400|        High|
| 11|  Alice| 57|    Chicago| 69692|      Medium|
| 12|  Alice| 44|Los Angeles| 52611|      Medium|
| 13|    Bob| 53|    Houston| 69018|      Medium|
| 14|  David| 57|    Chicago| 66389|      Medium|
| 15|    Bob| 28|    Chicago| 71627|      Medium|
| 16|  David| 37|   New York| 38964|         Low|
| 17|  Alice| 52|    Chicago| 31275|         Low|
| 18|    Bob| 44|   New York| 56190|      Medium|
| 19|    Bob| 48|Los Angeles| 51606|      Medium|
| 20|Charlie| 56|    Chicago| 89405|        High|
+---+-------+---+-----------+------+------------+
only showing top 20 rows

In [14]:
salary_range_sql = spark.sql("""SELECT *, CASE WHEN salary <50000 THEN "Low"
                                           WHEN salary BETWEEN 50000 AND 75000 THEN "Medium"
                                           ELSE "High"
                                           END as salary_range 
                            FROM personas""")
salary_range_sql.show()

+---+-------+---+-----------+------+------------+
| id|   name|age|       city|salary|salary_range|
+---+-------+---+-----------+------+------------+
|  1|  Alice| 45|Los Angeles| 98205|        High|
|  2|Charlie| 35|    Houston| 90582|        High|
|  3|    Bob| 28|    Chicago| 82072|        High|
|  4|  David| 21|Los Angeles| 52764|      Medium|
|  5|    Bob| 53|   New York| 63448|      Medium|
|  6|    Bob| 50|    Chicago| 70690|      Medium|
|  7|  Alice| 20|   New York| 73682|      Medium|
|  8|  David| 33|    Houston| 88183|        High|
|  9|Charlie| 26|    Houston| 42488|         Low|
| 10|  David| 34|    Chicago| 87400|        High|
| 11|  Alice| 57|    Chicago| 69692|      Medium|
| 12|  Alice| 44|Los Angeles| 52611|      Medium|
| 13|    Bob| 53|    Houston| 69018|      Medium|
| 14|  David| 57|    Chicago| 66389|      Medium|
| 15|    Bob| 28|    Chicago| 71627|      Medium|
| 16|  David| 37|   New York| 38964|         Low|
| 17|  Alice| 52|    Chicago| 31275|         Low|
| 18|    Bob| 44|   New York| 56190|      Medium|
| 19|    Bob| 48|Los Angeles| 51606|      Medium|
| 20|Charlie| 56|    Chicago| 89405|        High|
+---+-------+---+-----------+------+------------+
only showing top 20 rows

Ejercicio 7: Uni贸n de DataFrames
Divide el DataFrame original en dos: uno con id, name, age y otro con id, city, salary. Luego, 煤nelos nuevamente por id.
Realiza lo mismo utilizando SQL.

In [15]:
primero = csv.select("id", "name", "age")
primero.show()

+---+-------+---+
| id|   name|age|
+---+-------+---+
|  1|  Alice| 45|
|  2|Charlie| 35|
|  3|    Bob| 28|
|  4|  David| 21|
|  5|    Bob| 53|
|  6|    Bob| 50|
|  7|  Alice| 20|
|  8|  David| 33|
|  9|Charlie| 26|
| 10|  David| 34|
| 11|  Alice| 57|
| 12|  Alice| 44|
| 13|    Bob| 53|
| 14|  David| 57|
| 15|    Bob| 28|
| 16|  David| 37|
| 17|  Alice| 52|
| 18|    Bob| 44|
| 19|    Bob| 48|
| 20|Charlie| 56|
+---+-------+---+
only showing top 20 rows

In [16]:
segundo = csv.select("id", "city", "salary")
segundo.show()

+---+-----------+------+
| id|       city|salary|
+---+-----------+------+
|  1|Los Angeles| 98205|
|  2|    Houston| 90582|
|  3|    Chicago| 82072|
|  4|Los Angeles| 52764|
|  5|   New York| 63448|
|  6|    Chicago| 70690|
|  7|   New York| 73682|
|  8|    Houston| 88183|
|  9|    Houston| 42488|
| 10|    Chicago| 87400|
| 11|    Chicago| 69692|
| 12|Los Angeles| 52611|
| 13|    Houston| 69018|
| 14|    Chicago| 66389|
| 15|    Chicago| 71627|
| 16|   New York| 38964|
| 17|    Chicago| 31275|
| 18|   New York| 56190|
| 19|Los Angeles| 51606|
| 20|    Chicago| 89405|
+---+-----------+------+
only showing top 20 rows

In [17]:
completo = primero.join(segundo, primero.id == segundo.id, "inner")
completo.show()

+---+-------+---+---+-----------+------+
| id|   name|age| id|       city|salary|
+---+-------+---+---+-----------+------+
|  1|  Alice| 45|  1|Los Angeles| 98205|
|  2|Charlie| 35|  2|    Houston| 90582|
|  3|    Bob| 28|  3|    Chicago| 82072|
|  4|  David| 21|  4|Los Angeles| 52764|
|  5|    Bob| 53|  5|   New York| 63448|
|  6|    Bob| 50|  6|    Chicago| 70690|
|  7|  Alice| 20|  7|   New York| 73682|
|  8|  David| 33|  8|    Houston| 88183|
|  9|Charlie| 26|  9|    Houston| 42488|
| 10|  David| 34| 10|    Chicago| 87400|
| 11|  Alice| 57| 11|    Chicago| 69692|
| 12|  Alice| 44| 12|Los Angeles| 52611|
| 13|    Bob| 53| 13|    Houston| 69018|
| 14|  David| 57| 14|    Chicago| 66389|
| 15|    Bob| 28| 15|    Chicago| 71627|
| 16|  David| 37| 16|   New York| 38964|
| 17|  Alice| 52| 17|    Chicago| 31275|
| 18|    Bob| 44| 18|   New York| 56190|
| 19|    Bob| 48| 19|Los Angeles| 51606|
| 20|Charlie| 56| 20|    Chicago| 89405|
+---+-------+---+---+-----------+------+
only showing top 20 rows

In [18]:
completo = primero.join(segundo, on="id") #poniendo el ON no se duplica la columna "id"
completo.show()

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  2|Charlie| 35|    Houston| 90582|
|  3|    Bob| 28|    Chicago| 82072|
|  4|  David| 21|Los Angeles| 52764|
|  5|    Bob| 53|   New York| 63448|
|  6|    Bob| 50|    Chicago| 70690|
|  7|  Alice| 20|   New York| 73682|
|  8|  David| 33|    Houston| 88183|
|  9|Charlie| 26|    Houston| 42488|
| 10|  David| 34|    Chicago| 87400|
| 11|  Alice| 57|    Chicago| 69692|
| 12|  Alice| 44|Los Angeles| 52611|
| 13|    Bob| 53|    Houston| 69018|
| 14|  David| 57|    Chicago| 66389|
| 15|    Bob| 28|    Chicago| 71627|
| 16|  David| 37|   New York| 38964|
| 17|  Alice| 52|    Chicago| 31275|
| 18|    Bob| 44|   New York| 56190|
| 19|    Bob| 48|Los Angeles| 51606|
| 20|Charlie| 56|    Chicago| 89405|
+---+-------+---+-----------+------+
only showing top 20 rows

In [46]:
primero_sql = csv.select("id", "name", "age")
segundo_sql = csv.select("id", "city", "salary")
primero_sql.createOrReplaceTempView("primero")
segundo_sql.createOrReplaceTempView("segundo")

completo_sql = spark.sql("""SELECT primero.name, segundo.city, primero.id
                      FROM primero JOIN segundo ON primero.id == segundo.id""")
completo_sql.show()

+-------+-----------+---+
|   name|       city| id|
+-------+-----------+---+
|  Alice|Los Angeles|  1|
|Charlie|    Houston|  2|
|    Bob|    Chicago|  3|
|  David|Los Angeles|  4|
|    Bob|   New York|  5|
|    Bob|    Chicago|  6|
|  Alice|   New York|  7|
|  David|    Houston|  8|
|Charlie|    Houston|  9|
|  David|    Chicago| 10|
|  Alice|    Chicago| 11|
|  Alice|Los Angeles| 12|
|    Bob|    Houston| 13|
|  David|    Chicago| 14|
|    Bob|    Chicago| 15|
|  David|   New York| 16|
|  Alice|    Chicago| 17|
|    Bob|   New York| 18|
|    Bob|Los Angeles| 19|
|Charlie|    Chicago| 20|
+-------+-----------+---+
only showing top 20 rows

Ejercicio 8: Eliminaci贸n de Duplicados
Elimina los registros duplicados basados en el campo name.
Realiza lo mismo utilizando SQL.

In [23]:
eliminados = csv.dropDuplicates(["name"])
eliminados.show()

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  3|    Bob| 28|    Chicago| 82072|
|  2|Charlie| 35|    Houston| 90582|
|  4|  David| 21|Los Angeles| 52764|
+---+-------+---+-----------+------+

In [24]:
eliminados_sql = spark.sql("SELECT DISTINCT name, age, city, salary FROM personas")
eliminados_sql.show()

+-------+---+-----------+------+
|   name|age|       city|salary|
+-------+---+-----------+------+
|  Alice| 33|    Houston| 84739|
|Charlie| 35|   New York| 68443|
|    Bob| 22|    Houston| 60637|
|Charlie| 40|    Chicago| 37136|
|    Bob| 53|    Chicago| 31953|
|  Alice| 33|   New York| 59904|
|    Bob| 32|    Houston| 43453|
|  Alice| 55|    Chicago| 89385|
|  Alice| 43|    Houston| 65244|
|Charlie| 46|Los Angeles| 48673|
|Charlie| 59|    Chicago| 89077|
|  Alice| 37|    Houston| 79153|
|    Bob| 25|Los Angeles| 63736|
|  Alice| 59|    Houston| 55627|
|    Bob| 20|    Houston| 45187|
|  Alice| 28|Los Angeles| 77176|
|  David| 49|    Chicago| 80437|
|  David| 44|Los Angeles| 42327|
|  David| 55|Los Angeles| 58963|
|Charlie| 41|    Houston| 87406|
+-------+---+-----------+------+
only showing top 20 rows

Ejercicio 9: Manejo de Valores Nulos
Reemplaza los valores nulos en la columna salary por el salario promedio.
Realiza lo mismo utilizando SQL.

In [25]:
s_prom = csv.select(F.mean(F.col("salary"))).collect()[0][0]
s_prom

65028.87849

In [26]:
relleno = csv.na.fill({"salary": s_prom})
relleno.show()

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  2|Charlie| 35|    Houston| 90582|
|  3|    Bob| 28|    Chicago| 82072|
|  4|  David| 21|Los Angeles| 52764|
|  5|    Bob| 53|   New York| 63448|
|  6|    Bob| 50|    Chicago| 70690|
|  7|  Alice| 20|   New York| 73682|
|  8|  David| 33|    Houston| 88183|
|  9|Charlie| 26|    Houston| 42488|
| 10|  David| 34|    Chicago| 87400|
| 11|  Alice| 57|    Chicago| 69692|
| 12|  Alice| 44|Los Angeles| 52611|
| 13|    Bob| 53|    Houston| 69018|
| 14|  David| 57|    Chicago| 66389|
| 15|    Bob| 28|    Chicago| 71627|
| 16|  David| 37|   New York| 38964|
| 17|  Alice| 52|    Chicago| 31275|
| 18|    Bob| 44|   New York| 56190|
| 19|    Bob| 48|Los Angeles| 51606|
| 20|Charlie| 56|    Chicago| 89405|
+---+-------+---+-----------+------+
only showing top 20 rows

In [27]:
relleno_sql = spark.sql(f"""SELECT *, COALESCE (salary, {s_prom}) as salary_prom 
                        FROM personas""")
relleno_sql.show()

+---+-------+---+-----------+------+-----------+
| id|   name|age|       city|salary|salary_prom|
+---+-------+---+-----------+------+-----------+
|  1|  Alice| 45|Los Angeles| 98205|98205.00000|
|  2|Charlie| 35|    Houston| 90582|90582.00000|
|  3|    Bob| 28|    Chicago| 82072|82072.00000|
|  4|  David| 21|Los Angeles| 52764|52764.00000|
|  5|    Bob| 53|   New York| 63448|63448.00000|
|  6|    Bob| 50|    Chicago| 70690|70690.00000|
|  7|  Alice| 20|   New York| 73682|73682.00000|
|  8|  David| 33|    Houston| 88183|88183.00000|
|  9|Charlie| 26|    Houston| 42488|42488.00000|
| 10|  David| 34|    Chicago| 87400|87400.00000|
| 11|  Alice| 57|    Chicago| 69692|69692.00000|
| 12|  Alice| 44|Los Angeles| 52611|52611.00000|
| 13|    Bob| 53|    Houston| 69018|69018.00000|
| 14|  David| 57|    Chicago| 66389|66389.00000|
| 15|    Bob| 28|    Chicago| 71627|71627.00000|
| 16|  David| 37|   New York| 38964|38964.00000|
| 17|  Alice| 52|    Chicago| 31275|31275.00000|
| 18|    Bob| 44|   New York| 56190|56190.00000|
| 19|    Bob| 48|Los Angeles| 51606|51606.00000|
| 20|Charlie| 56|    Chicago| 89405|89405.00000|
+---+-------+---+-----------+------+-----------+
only showing top 20 rows

Ejercicio 10: Conversi贸n de Datos
Convierte la columna age a tipo float.
Realiza lo mismo utilizando SQL.

In [28]:
age_float = csv.withColumn("age", F.col("age").cast("float"))
age_float.show()

+---+-------+----+-----------+------+
| id|   name| age|       city|salary|
+---+-------+----+-----------+------+
|  1|  Alice|45.0|Los Angeles| 98205|
|  2|Charlie|35.0|    Houston| 90582|
|  3|    Bob|28.0|    Chicago| 82072|
|  4|  David|21.0|Los Angeles| 52764|
|  5|    Bob|53.0|   New York| 63448|
|  6|    Bob|50.0|    Chicago| 70690|
|  7|  Alice|20.0|   New York| 73682|
|  8|  David|33.0|    Houston| 88183|
|  9|Charlie|26.0|    Houston| 42488|
| 10|  David|34.0|    Chicago| 87400|
| 11|  Alice|57.0|    Chicago| 69692|
| 12|  Alice|44.0|Los Angeles| 52611|
| 13|    Bob|53.0|    Houston| 69018|
| 14|  David|57.0|    Chicago| 66389|
| 15|    Bob|28.0|    Chicago| 71627|
| 16|  David|37.0|   New York| 38964|
| 17|  Alice|52.0|    Chicago| 31275|
| 18|    Bob|44.0|   New York| 56190|
| 19|    Bob|48.0|Los Angeles| 51606|
| 20|Charlie|56.0|    Chicago| 89405|
+---+-------+----+-----------+------+
only showing top 20 rows

In [29]:
age_float_sql = spark.sql("""SELECT *, CAST(age AS FLOAT) FROM personas """)
age_float_sql.show()

+---+-------+---+-----------+------+----+
| id|   name|age|       city|salary| age|
+---+-------+---+-----------+------+----+
|  1|  Alice| 45|Los Angeles| 98205|45.0|
|  2|Charlie| 35|    Houston| 90582|35.0|
|  3|    Bob| 28|    Chicago| 82072|28.0|
|  4|  David| 21|Los Angeles| 52764|21.0|
|  5|    Bob| 53|   New York| 63448|53.0|
|  6|    Bob| 50|    Chicago| 70690|50.0|
|  7|  Alice| 20|   New York| 73682|20.0|
|  8|  David| 33|    Houston| 88183|33.0|
|  9|Charlie| 26|    Houston| 42488|26.0|
| 10|  David| 34|    Chicago| 87400|34.0|
| 11|  Alice| 57|    Chicago| 69692|57.0|
| 12|  Alice| 44|Los Angeles| 52611|44.0|
| 13|    Bob| 53|    Houston| 69018|53.0|
| 14|  David| 57|    Chicago| 66389|57.0|
| 15|    Bob| 28|    Chicago| 71627|28.0|
| 16|  David| 37|   New York| 38964|37.0|
| 17|  Alice| 52|    Chicago| 31275|52.0|
| 18|    Bob| 44|   New York| 56190|44.0|
| 19|    Bob| 48|Los Angeles| 51606|48.0|
| 20|Charlie| 56|    Chicago| 89405|56.0|
+---+-------+---+-----------+------+----+
only showing top 20 rows

Ejercicio 11: An谩lisis de Datos Estad铆sticos
Calcula el salario m谩ximo, m铆nimo, promedio y la desviaci贸n est谩ndar.
Realiza lo mismo utilizando SQL.

In [30]:
estadisticos = csv.select("salary").describe()
estadisticos.show()

+-------+------------------+
|summary|            salary|
+-------+------------------+
|  count|            100000|
|   mean|       65028.87849|
| stddev|20201.002317524464|
|    min|             30000|
|    max|             99998|
+-------+------------------+

In [31]:
stats = csv.agg(
    F.max("salary").alias("max_salary"),
    F.min("salary").alias("min_salary"),
    F.avg("salary").alias("prom_salary"),
    F.stddev("salary").alias("desv_est_salary")
)
stats.show()

+----------+----------+-----------+------------------+
|max_salary|min_salary|prom_salary|   desv_est_salary|
+----------+----------+-----------+------------------+
|     99998|     30000|65028.87849|20201.002317524464|
+----------+----------+-----------+------------------+

In [32]:
stats_sql = spark.sql("""SELECT MAX(salary) as max_salary,
                                MIN(salary) as min_salary,
                                AVG(salary) as prom_salary,
                                STDDEV(salary) as desv_est_salary
                                FROM personas
                                """)
stats_sql.show()

+----------+----------+-----------+------------------+
|max_salary|min_salary|prom_salary|   desv_est_salary|
+----------+----------+-----------+------------------+
|     99998|     30000|65028.87849|20201.002317524464|
+----------+----------+-----------+------------------+

Ejercicio 12: Aplicaci贸n de Funciones de Ventana
Calcula el salario promedio por ciudad utilizando funciones de ventana.
Realiza lo mismo utilizando SQL.

In [34]:
ventana = Window.partitionBy("city")
s_promedio = csv.withColumn("s_prom", F.avg("salary").over(ventana))
s_promedio.show()

+---+-------+---+-------+------+----------------+
| id|   name|age|   city|salary|          s_prom|
+---+-------+---+-------+------+----------------+
|  3|    Bob| 28|Chicago| 82072|64844.2011753888|
|  6|    Bob| 50|Chicago| 70690|64844.2011753888|
| 10|  David| 34|Chicago| 87400|64844.2011753888|
| 11|  Alice| 57|Chicago| 69692|64844.2011753888|
| 14|  David| 57|Chicago| 66389|64844.2011753888|
| 15|    Bob| 28|Chicago| 71627|64844.2011753888|
| 17|  Alice| 52|Chicago| 31275|64844.2011753888|
| 20|Charlie| 56|Chicago| 89405|64844.2011753888|
| 21|  Alice| 54|Chicago| 85145|64844.2011753888|
| 30|  David| 47|Chicago| 64246|64844.2011753888|
| 33|    Bob| 34|Chicago| 35519|64844.2011753888|
| 40|Charlie| 21|Chicago| 43475|64844.2011753888|
| 41|  David| 44|Chicago| 82277|64844.2011753888|
| 44|Charlie| 42|Chicago| 53252|64844.2011753888|
| 45|  Alice| 38|Chicago| 36914|64844.2011753888|
| 50|  David| 27|Chicago| 42880|64844.2011753888|
| 51|  David| 58|Chicago| 88499|64844.2011753888|
| 56|    Bob| 26|Chicago| 88448|64844.2011753888|
| 59|  Alice| 32|Chicago| 81977|64844.2011753888|
| 63|  David| 32|Chicago| 83523|64844.2011753888|
+---+-------+---+-------+------+----------------+
only showing top 20 rows

In [35]:
ventana_sql = spark.sql(""" SELECT *, 
                            AVG(salary) OVER (PARTITION BY city) as s_prom 
                            FROM personas """)
ventana_sql.show()

+---+-------+---+-------+------+----------------+
| id|   name|age|   city|salary|          s_prom|
+---+-------+---+-------+------+----------------+
|  3|    Bob| 28|Chicago| 82072|64844.2011753888|
|  6|    Bob| 50|Chicago| 70690|64844.2011753888|
| 10|  David| 34|Chicago| 87400|64844.2011753888|
| 11|  Alice| 57|Chicago| 69692|64844.2011753888|
| 14|  David| 57|Chicago| 66389|64844.2011753888|
| 15|    Bob| 28|Chicago| 71627|64844.2011753888|
| 17|  Alice| 52|Chicago| 31275|64844.2011753888|
| 20|Charlie| 56|Chicago| 89405|64844.2011753888|
| 21|  Alice| 54|Chicago| 85145|64844.2011753888|
| 30|  David| 47|Chicago| 64246|64844.2011753888|
| 33|    Bob| 34|Chicago| 35519|64844.2011753888|
| 40|Charlie| 21|Chicago| 43475|64844.2011753888|
| 41|  David| 44|Chicago| 82277|64844.2011753888|
| 44|Charlie| 42|Chicago| 53252|64844.2011753888|
| 45|  Alice| 38|Chicago| 36914|64844.2011753888|
| 50|  David| 27|Chicago| 42880|64844.2011753888|
| 51|  David| 58|Chicago| 88499|64844.2011753888|
| 56|    Bob| 26|Chicago| 88448|64844.2011753888|
| 59|  Alice| 32|Chicago| 81977|64844.2011753888|
| 63|  David| 32|Chicago| 83523|64844.2011753888|
+---+-------+---+-------+------+----------------+
only showing top 20 rows

Ejercicio 13: Pivotar DataFrames
Realiza un pivot table para ver el salario promedio por city y name.
Realiza lo mismo utilizando SQL.

In [38]:
pivot = csv.groupBy("city").pivot("name").agg(F.avg("salary"))
pivot.show()

+-----------+-----------------+------------------+------------------+------------------+
|       city|            Alice|               Bob|           Charlie|             David|
+-----------+-----------------+------------------+------------------+------------------+
|Los Angeles|65469.02425614489| 65006.71658179504| 65210.91188293938|65390.802979336855|
|    Chicago|64933.36254728878| 64561.29275409305|  65236.3021777142| 64636.90771460783|
|    Houston| 65094.8303686934| 64790.22002571521| 65104.80758764207|64892.271529411766|
|   New York|65010.17736087025|64843.845139771285|65102.253031269945| 65182.82881411303|
+-----------+-----------------+------------------+------------------+------------------+

In [40]:
pivot_sql = spark.sql(""" SELECT city, 
                          AVG(CASE WHEN name = 'Alice' THEN salary END) as Alice_s_prom, 
                          AVG(CASE WHEN name = 'Bob' THEN salary END) as Bob_s_prom,
                          AVG(CASE WHEN name = 'Charlie' THEN salary END) as Charlie_s_prom,
                          AVG(CASE WHEN name = 'David' THEN salary END) as David_s_prom
                          FROM personas
                          GROUP BY city""")
pivot_sql.show()

+-----------+-----------------+------------------+------------------+------------------+
|       city|     Alice_s_prom|        Bob_s_prom|    Charlie_s_prom|      David_s_prom|
+-----------+-----------------+------------------+------------------+------------------+
|Los Angeles|65469.02425614489| 65006.71658179504| 65210.91188293938|65390.802979336855|
|    Chicago|64933.36254728878| 64561.29275409305|  65236.3021777142| 64636.90771460783|
|    Houston| 65094.8303686934| 64790.22002571521| 65104.80758764207|64892.271529411766|
|   New York|65010.17736087025|64843.845139771285|65102.253031269945| 65182.82881411303|
+-----------+-----------------+------------------+------------------+------------------+

Ejercicio 14: Joins Avanzados
Realiza un left join entre dos DataFrames creados previamente.
Realiza lo mismo utilizando SQL.

In [44]:
completo_left = primero.join(segundo, on ="id", how="left")
completo_left.show()

+---+-------+---+-----------+------+
| id|   name|age|       city|salary|
+---+-------+---+-----------+------+
|  1|  Alice| 45|Los Angeles| 98205|
|  2|Charlie| 35|    Houston| 90582|
|  3|    Bob| 28|    Chicago| 82072|
|  4|  David| 21|Los Angeles| 52764|
|  5|    Bob| 53|   New York| 63448|
|  6|    Bob| 50|    Chicago| 70690|
|  7|  Alice| 20|   New York| 73682|
|  8|  David| 33|    Houston| 88183|
|  9|Charlie| 26|    Houston| 42488|
| 10|  David| 34|    Chicago| 87400|
| 11|  Alice| 57|    Chicago| 69692|
| 12|  Alice| 44|Los Angeles| 52611|
| 13|    Bob| 53|    Houston| 69018|
| 14|  David| 57|    Chicago| 66389|
| 15|    Bob| 28|    Chicago| 71627|
| 16|  David| 37|   New York| 38964|
| 17|  Alice| 52|    Chicago| 31275|
| 18|    Bob| 44|   New York| 56190|
| 19|    Bob| 48|Los Angeles| 51606|
| 20|Charlie| 56|    Chicago| 89405|
+---+-------+---+-----------+------+
only showing top 20 rows

M谩s info sobre joins: https://sparkbyexamples.com/pyspark/pyspark-join-explained-with-examples/

In [53]:
uno_sql = csv.select("id", "name", "age")
dos_sql = csv.select("id", "city", "salary")

uno_sql.createOrReplaceTempView("uno")
dos_sql.createOrReplaceTempView("dos")

In [56]:
completo_left_sql = spark.sql(""" SELECT uno.name, dos.city, uno.id
                                  FROM uno
                                  LEFT JOIN dos ON uno.id = dos.id """)
completo_left_sql.show()

+-------+-----------+---+
|   name|       city| id|
+-------+-----------+---+
|  Alice|Los Angeles|  1|
|Charlie|    Houston|  2|
|    Bob|    Chicago|  3|
|  David|Los Angeles|  4|
|    Bob|   New York|  5|
|    Bob|    Chicago|  6|
|  Alice|   New York|  7|
|  David|    Houston|  8|
|Charlie|    Houston|  9|
|  David|    Chicago| 10|
|  Alice|    Chicago| 11|
|  Alice|Los Angeles| 12|
|    Bob|    Houston| 13|
|  David|    Chicago| 14|
|    Bob|    Chicago| 15|
|  David|   New York| 16|
|  Alice|    Chicago| 17|
|    Bob|   New York| 18|
|    Bob|Los Angeles| 19|
|Charlie|    Chicago| 20|
+-------+-----------+---+
only showing top 20 rows

Ejercicio 15: Explode de Columnas
Crea una columna con una lista de valores y luego expl贸tala en filas individuales.
Realiza lo mismo utilizando SQL.

In [58]:
listado = csv.withColumn("Nombres", F.split(F.col("name"), "-"))
listado.show()

+---+-------+---+-----------+------+---------+
| id|   name|age|       city|salary|  Nombres|
+---+-------+---+-----------+------+---------+
|  1|  Alice| 45|Los Angeles| 98205|  [Alice]|
|  2|Charlie| 35|    Houston| 90582|[Charlie]|
|  3|    Bob| 28|    Chicago| 82072|    [Bob]|
|  4|  David| 21|Los Angeles| 52764|  [David]|
|  5|    Bob| 53|   New York| 63448|    [Bob]|
|  6|    Bob| 50|    Chicago| 70690|    [Bob]|
|  7|  Alice| 20|   New York| 73682|  [Alice]|
|  8|  David| 33|    Houston| 88183|  [David]|
|  9|Charlie| 26|    Houston| 42488|[Charlie]|
| 10|  David| 34|    Chicago| 87400|  [David]|
| 11|  Alice| 57|    Chicago| 69692|  [Alice]|
| 12|  Alice| 44|Los Angeles| 52611|  [Alice]|
| 13|    Bob| 53|    Houston| 69018|    [Bob]|
| 14|  David| 57|    Chicago| 66389|  [David]|
| 15|    Bob| 28|    Chicago| 71627|    [Bob]|
| 16|  David| 37|   New York| 38964|  [David]|
| 17|  Alice| 52|    Chicago| 31275|  [Alice]|
| 18|    Bob| 44|   New York| 56190|    [Bob]|
| 19|    Bob| 48|Los Angeles| 51606|    [Bob]|
| 20|Charlie| 56|    Chicago| 89405|[Charlie]|
+---+-------+---+-----------+------+---------+
only showing top 20 rows

In [59]:
explosion = listado.withColumn("Nombres pum", F.explode(F.col("Nombres")))
explosion.show()

+---+-------+---+-----------+------+---------+-----------+
| id|   name|age|       city|salary|  Nombres|Nombres pum|
+---+-------+---+-----------+------+---------+-----------+
|  1|  Alice| 45|Los Angeles| 98205|  [Alice]|      Alice|
|  2|Charlie| 35|    Houston| 90582|[Charlie]|    Charlie|
|  3|    Bob| 28|    Chicago| 82072|    [Bob]|        Bob|
|  4|  David| 21|Los Angeles| 52764|  [David]|      David|
|  5|    Bob| 53|   New York| 63448|    [Bob]|        Bob|
|  6|    Bob| 50|    Chicago| 70690|    [Bob]|        Bob|
|  7|  Alice| 20|   New York| 73682|  [Alice]|      Alice|
|  8|  David| 33|    Houston| 88183|  [David]|      David|
|  9|Charlie| 26|    Houston| 42488|[Charlie]|    Charlie|
| 10|  David| 34|    Chicago| 87400|  [David]|      David|
| 11|  Alice| 57|    Chicago| 69692|  [Alice]|      Alice|
| 12|  Alice| 44|Los Angeles| 52611|  [Alice]|      Alice|
| 13|    Bob| 53|    Houston| 69018|    [Bob]|        Bob|
| 14|  David| 57|    Chicago| 66389|  [David]|      David|
| 15|    Bob| 28|    Chicago| 71627|    [Bob]|        Bob|
| 16|  David| 37|   New York| 38964|  [David]|      David|
| 17|  Alice| 52|    Chicago| 31275|  [Alice]|      Alice|
| 18|    Bob| 44|   New York| 56190|    [Bob]|        Bob|
| 19|    Bob| 48|Los Angeles| 51606|    [Bob]|        Bob|
| 20|Charlie| 56|    Chicago| 89405|[Charlie]|    Charlie|
+---+-------+---+-----------+------+---------+-----------+
only showing top 20 rows

M谩s info sobre explode: https://sparkbyexamples.com/pyspark/pyspark-explode-array-and-map-columns-to-rows/

In [62]:
listado_sql = spark.sql("SELECT *, SPLIT(name, ',') FROM personas")
explosion_sql = spark.sql("SELECT *, EXPLODE(SPLIT(name, ',')) as nombres_expl FROM personas")
explosion_sql.show()

+---+-------+---+-----------+------+------------+
| id|   name|age|       city|salary|nombres_expl|
+---+-------+---+-----------+------+------------+
|  1|  Alice| 45|Los Angeles| 98205|       Alice|
|  2|Charlie| 35|    Houston| 90582|     Charlie|
|  3|    Bob| 28|    Chicago| 82072|         Bob|
|  4|  David| 21|Los Angeles| 52764|       David|
|  5|    Bob| 53|   New York| 63448|         Bob|
|  6|    Bob| 50|    Chicago| 70690|         Bob|
|  7|  Alice| 20|   New York| 73682|       Alice|
|  8|  David| 33|    Houston| 88183|       David|
|  9|Charlie| 26|    Houston| 42488|     Charlie|
| 10|  David| 34|    Chicago| 87400|       David|
| 11|  Alice| 57|    Chicago| 69692|       Alice|
| 12|  Alice| 44|Los Angeles| 52611|       Alice|
| 13|    Bob| 53|    Houston| 69018|         Bob|
| 14|  David| 57|    Chicago| 66389|       David|
| 15|    Bob| 28|    Chicago| 71627|         Bob|
| 16|  David| 37|   New York| 38964|       David|
| 17|  Alice| 52|    Chicago| 31275|       Alice|
| 18|    Bob| 44|   New York| 56190|         Bob|
| 19|    Bob| 48|Los Angeles| 51606|         Bob|
| 20|Charlie| 56|    Chicago| 89405|     Charlie|
+---+-------+---+-----------+------+------------+
only showing top 20 rows

Ejercicio 16: Creaci贸n de DataFrames a partir de JSON
Crea un DataFrame a partir de un archivo JSON generado con datos similares al CSV.
Realiza consultas SQL sobre el DataFrame.

In [64]:
json = spark.read.json("./data/people_data.json")
json.show()

+---+------+--------------+---------+-------------+
|Age|Gender|        Height|     Name|       Weight|
+---+------+--------------+---------+-------------+
| 42|  Male|173.1080003313| Santiago|84.0929337303|
| 40|Female|183.3381094765|   Mart铆n|70.5996907081|
| 57|  Male|157.4917543892|   Miguel|70.1042839761|
| 63|Female|193.7021285076|  Gonzalo|65.6092609194|
| 72|  Male|150.1650602517|     Juan|73.1779033685|
| 56|Female|180.8417615332|  Gabriel| 69.996318682|
| 74|  Male|172.7050887788|  Beatriz|74.7531546739|
| 61|Female|165.3600443377|   Vanesa| 51.019898216|
| 28|  Male|184.0369379815|  Agust铆n|82.1466031125|
| 79|Female|150.3962651097|Elizabeth|56.6157624012|
| 39|Female|159.6807616619|    Ail茅n|71.5668292692|
| 64|Female|172.6796469505|Elizabeth|61.1621114246|
| 19|  Male|168.0551115101|   Carlos|61.6563798291|
| 47|Female|157.1945884327|  Luciana|78.6749731216|
| 47|  Male|178.7326391494|    Sof铆a|97.4625988168|
| 77|Female|164.5070877048|  Facundo|82.3950452225|
| 53|  Male|182.6149462603|  Facundo|71.9000351794|
| 55|Female|159.7694254588|  Mariana|90.0028081564|
| 37|  Male|150.4123972918|   Andr茅s|68.3696137171|
| 36|Female|152.7363813014|   Lorena|51.7963718759|
+---+------+--------------+---------+-------------+
only showing top 20 rows

In [69]:
json_sql = json.createOrReplaceTempView("datos_personales")

In [68]:
consulta1 = spark.sql(""" SELECT * FROM datos_personales """)
consulta1.show()

+---+------+--------------+---------+-------------+
|Age|Gender|        Height|     Name|       Weight|
+---+------+--------------+---------+-------------+
| 42|  Male|173.1080003313| Santiago|84.0929337303|
| 40|Female|183.3381094765|   Mart铆n|70.5996907081|
| 57|  Male|157.4917543892|   Miguel|70.1042839761|
| 63|Female|193.7021285076|  Gonzalo|65.6092609194|
| 72|  Male|150.1650602517|     Juan|73.1779033685|
| 56|Female|180.8417615332|  Gabriel| 69.996318682|
| 74|  Male|172.7050887788|  Beatriz|74.7531546739|
| 61|Female|165.3600443377|   Vanesa| 51.019898216|
| 28|  Male|184.0369379815|  Agust铆n|82.1466031125|
| 79|Female|150.3962651097|Elizabeth|56.6157624012|
| 39|Female|159.6807616619|    Ail茅n|71.5668292692|
| 64|Female|172.6796469505|Elizabeth|61.1621114246|
| 19|  Male|168.0551115101|   Carlos|61.6563798291|
| 47|Female|157.1945884327|  Luciana|78.6749731216|
| 47|  Male|178.7326391494|    Sof铆a|97.4625988168|
| 77|Female|164.5070877048|  Facundo|82.3950452225|
| 53|  Male|182.6149462603|  Facundo|71.9000351794|
| 55|Female|159.7694254588|  Mariana|90.0028081564|
| 37|  Male|150.4123972918|   Andr茅s|68.3696137171|
| 36|Female|152.7363813014|   Lorena|51.7963718759|
+---+------+--------------+---------+-------------+
only showing top 20 rows

In [71]:
consulta2 = spark.sql(""" SELECT Age, Name, Weight, Height
                          FROM datos_personales
                          WHERE Height > 160
                          ORDER BY Weight""")
consulta2.show()

+---+--------+-------------+--------------+
|Age|    Name|       Weight|        Height|
+---+--------+-------------+--------------+
| 70|Santiago|50.0008737169|199.5028926439|
| 67| Gonzalo|50.0020737988|199.1935857788|
| 72|  Javier|50.0026378154|163.2403254242|
| 29| Agust铆n|50.0030051322|172.6609588698|
| 39|  Marcos|50.0032266126|161.8195709842|
| 22|   Jorge|50.0032572915|161.6509415655|
| 55| Roberto|50.0038209674| 176.056363331|
| 77|   Ail茅n|50.0038900259|192.5748101075|
| 74|  Lorena|50.0041132399|196.5235303932|
| 61|  Javier|50.0046147379| 173.011958326|
| 56| Agust铆n|50.0051439249| 183.302055732|
| 70|   Jorge|50.0054086465|179.8459758842|
| 36|   Diego|50.0058798068|190.4226423708|
| 43|   Sof铆a|50.0065110147| 198.182545408|
| 68| Natalia|50.0067199858|198.1217197109|
| 43|  Camila|50.0081365167|184.7325328493|
| 23|  Daniel|50.0081821236|167.8365237979|
| 40|  Andr茅s|50.0086503137|163.0373225465|
| 66| Ricardo|50.0091074113|161.0079533761|
| 56|   Mateo|50.0100387108|190.0757758608|
+---+--------+-------------+--------------+
only showing top 20 rows

Ejercicio 17: Manejo de Fechas
Crea una nueva columna con una fecha aleatoria y luego realiza operaciones de manipulaci贸n de fechas (ej. agregar d铆as).
Realiza lo mismo utilizando SQL.

In [78]:
fechas = csv.withColumn("fecha", F.current_date())
fechas.show()

+---+-------+---+-----------+------+----------+
| id|   name|age|       city|salary|     fecha|
+---+-------+---+-----------+------+----------+
|  1|  Alice| 45|Los Angeles| 98205|2024-08-09|
|  2|Charlie| 35|    Houston| 90582|2024-08-09|
|  3|    Bob| 28|    Chicago| 82072|2024-08-09|
|  4|  David| 21|Los Angeles| 52764|2024-08-09|
|  5|    Bob| 53|   New York| 63448|2024-08-09|
|  6|    Bob| 50|    Chicago| 70690|2024-08-09|
|  7|  Alice| 20|   New York| 73682|2024-08-09|
|  8|  David| 33|    Houston| 88183|2024-08-09|
|  9|Charlie| 26|    Houston| 42488|2024-08-09|
| 10|  David| 34|    Chicago| 87400|2024-08-09|
| 11|  Alice| 57|    Chicago| 69692|2024-08-09|
| 12|  Alice| 44|Los Angeles| 52611|2024-08-09|
| 13|    Bob| 53|    Houston| 69018|2024-08-09|
| 14|  David| 57|    Chicago| 66389|2024-08-09|
| 15|    Bob| 28|    Chicago| 71627|2024-08-09|
| 16|  David| 37|   New York| 38964|2024-08-09|
| 17|  Alice| 52|    Chicago| 31275|2024-08-09|
| 18|    Bob| 44|   New York| 56190|2024-08-09|
| 19|    Bob| 48|Los Angeles| 51606|2024-08-09|
| 20|Charlie| 56|    Chicago| 89405|2024-08-09|
+---+-------+---+-----------+------+----------+
only showing top 20 rows

In [81]:
fechas = fechas.withColumn("futuro", F.date_add(F.col("fecha"), 10))
fechas.show()

+---+-------+---+-----------+------+----------+----------+
| id|   name|age|       city|salary|     fecha|    futuro|
+---+-------+---+-----------+------+----------+----------+
|  1|  Alice| 45|Los Angeles| 98205|2024-08-09|2024-08-19|
|  2|Charlie| 35|    Houston| 90582|2024-08-09|2024-08-19|
|  3|    Bob| 28|    Chicago| 82072|2024-08-09|2024-08-19|
|  4|  David| 21|Los Angeles| 52764|2024-08-09|2024-08-19|
|  5|    Bob| 53|   New York| 63448|2024-08-09|2024-08-19|
|  6|    Bob| 50|    Chicago| 70690|2024-08-09|2024-08-19|
|  7|  Alice| 20|   New York| 73682|2024-08-09|2024-08-19|
|  8|  David| 33|    Houston| 88183|2024-08-09|2024-08-19|
|  9|Charlie| 26|    Houston| 42488|2024-08-09|2024-08-19|
| 10|  David| 34|    Chicago| 87400|2024-08-09|2024-08-19|
| 11|  Alice| 57|    Chicago| 69692|2024-08-09|2024-08-19|
| 12|  Alice| 44|Los Angeles| 52611|2024-08-09|2024-08-19|
| 13|    Bob| 53|    Houston| 69018|2024-08-09|2024-08-19|
| 14|  David| 57|    Chicago| 66389|2024-08-09|2024-08-19|
| 15|    Bob| 28|    Chicago| 71627|2024-08-09|2024-08-19|
| 16|  David| 37|   New York| 38964|2024-08-09|2024-08-19|
| 17|  Alice| 52|    Chicago| 31275|2024-08-09|2024-08-19|
| 18|    Bob| 44|   New York| 56190|2024-08-09|2024-08-19|
| 19|    Bob| 48|Los Angeles| 51606|2024-08-09|2024-08-19|
| 20|Charlie| 56|    Chicago| 89405|2024-08-09|2024-08-19|
+---+-------+---+-----------+------+----------+----------+
only showing top 20 rows

M谩s info sobre fechas: https://medium.com/@uzzaman.ahmed/pyspark-date-time-functions-a-comprehensive-guide-b250e92df264

In [86]:
fechas_sql = spark.sql(""" SELECT *, 
                           CURRENT_DATE as hoy, 
                           DATE_ADD(CURRENT_DATE, 10) as en_10_dias
                           FROM datos_personales""")
fechas_sql.show()

+---+------+--------------+---------+-------------+----------+----------+
|Age|Gender|        Height|     Name|       Weight|       hoy|en_10_dias|
+---+------+--------------+---------+-------------+----------+----------+
| 42|  Male|173.1080003313| Santiago|84.0929337303|2024-08-09|2024-08-19|
| 40|Female|183.3381094765|   Mart铆n|70.5996907081|2024-08-09|2024-08-19|
| 57|  Male|157.4917543892|   Miguel|70.1042839761|2024-08-09|2024-08-19|
| 63|Female|193.7021285076|  Gonzalo|65.6092609194|2024-08-09|2024-08-19|
| 72|  Male|150.1650602517|     Juan|73.1779033685|2024-08-09|2024-08-19|
| 56|Female|180.8417615332|  Gabriel| 69.996318682|2024-08-09|2024-08-19|
| 74|  Male|172.7050887788|  Beatriz|74.7531546739|2024-08-09|2024-08-19|
| 61|Female|165.3600443377|   Vanesa| 51.019898216|2024-08-09|2024-08-19|
| 28|  Male|184.0369379815|  Agust铆n|82.1466031125|2024-08-09|2024-08-19|
| 79|Female|150.3962651097|Elizabeth|56.6157624012|2024-08-09|2024-08-19|
| 39|Female|159.6807616619|    Ail茅n|71.5668292692|2024-08-09|2024-08-19|
| 64|Female|172.6796469505|Elizabeth|61.1621114246|2024-08-09|2024-08-19|
| 19|  Male|168.0551115101|   Carlos|61.6563798291|2024-08-09|2024-08-19|
| 47|Female|157.1945884327|  Luciana|78.6749731216|2024-08-09|2024-08-19|
| 47|  Male|178.7326391494|    Sof铆a|97.4625988168|2024-08-09|2024-08-19|
| 77|Female|164.5070877048|  Facundo|82.3950452225|2024-08-09|2024-08-19|
| 53|  Male|182.6149462603|  Facundo|71.9000351794|2024-08-09|2024-08-19|
| 55|Female|159.7694254588|  Mariana|90.0028081564|2024-08-09|2024-08-19|
| 37|  Male|150.4123972918|   Andr茅s|68.3696137171|2024-08-09|2024-08-19|
| 36|Female|152.7363813014|   Lorena|51.7963718759|2024-08-09|2024-08-19|
+---+------+--------------+---------+-------------+----------+----------+
only showing top 20 rows

Ejercicio 18: Agrupaci贸n con condiciones
Agrupa los datos por ciudad y nombre, pero solo para registros donde el salario es mayor a 50,000.
Realiza lo mismo utilizando SQL.

In [95]:
agrupacion = csv.filter(F.col("salary")>50000).groupBy("city", "name").agg(F.avg("salary").alias("s_prom"))
agrupacion.show()

+-----------+-------+-----------------+
|       city|   name|           s_prom|
+-----------+-------+-----------------+
|Los Angeles|  David|75038.81898454746|
|    Houston|Charlie|75132.93897240296|
|    Houston|  David|74791.36401490247|
|Los Angeles|  Alice|75217.04523063144|
|   New York|    Bob|74886.95874219447|
|Los Angeles|    Bob|74688.70011025359|
|    Chicago|Charlie|75181.29809818664|
|   New York|  Alice|75296.81935197515|
|Los Angeles|Charlie|74981.22405713011|
|    Houston|    Bob|74725.10063176895|
|   New York|Charlie|74918.03466666667|
|    Chicago|  Alice|75198.00289467824|
|    Chicago|  David|74864.17159763313|
|   New York|  David|75111.63967242948|
|    Houston|  Alice|75275.12979351032|
|    Chicago|    Bob|  74619.704498744|
+-----------+-------+-----------------+

In [96]:
agrupacion_sql = spark.sql(""" SELECT * FROM personas WHERE salary >50000 ORDER BY city, name""")
agrupacion_sql.show()

+---+-----+---+-------+------+
| id| name|age|   city|salary|
+---+-----+---+-------+------+
|333|Alice| 46|Chicago| 83182|
|920|Alice| 20|Chicago| 51230|
|389|Alice| 31|Chicago| 61346|
| 11|Alice| 57|Chicago| 69692|
|394|Alice| 27|Chicago| 84152|
| 59|Alice| 32|Chicago| 81977|
|423|Alice| 56|Chicago| 60912|
| 86|Alice| 40|Chicago| 79070|
|430|Alice| 54|Chicago| 83492|
|284|Alice| 45|Chicago| 96552|
|483|Alice| 56|Chicago| 89070|
|119|Alice| 33|Chicago| 72687|
|507|Alice| 25|Chicago| 86839|
|195|Alice| 56|Chicago| 97033|
|571|Alice| 37|Chicago| 99720|
|198|Alice| 23|Chicago| 59124|
|602|Alice| 44|Chicago| 97192|
|730|Alice| 49|Chicago| 52886|
|915|Alice| 58|Chicago| 71892|
|758|Alice| 31|Chicago| 71406|
+---+-----+---+-------+------+
only showing top 20 rows

Ejercicio 19: Creaci贸n de Funciones UDF
Crea una funci贸n UDF para categorizar edades (ej. 'Joven', 'Adulto', 'Mayor').
Utiliza la UDF en una consulta SQL.

In [103]:
from pyspark.sql.types import StringType

In [104]:
def categorias_edades(age):
    if age < 30:
        return "Joven"
    elif age < 50:
        return "Adulto"
    else:
        return "Mayor"

edades_udf = F.udf(categorias_edades, StringType())
categorias_edades_df = csv.withColumn("categorias_edades", edades_udf(F.col("age")))
categorias_edades_df.show()

+---+-------+---+-----------+------+-----------------+
| id|   name|age|       city|salary|categorias_edades|
+---+-------+---+-----------+------+-----------------+
|  1|  Alice| 45|Los Angeles| 98205|           Adulto|
|  2|Charlie| 35|    Houston| 90582|           Adulto|
|  3|    Bob| 28|    Chicago| 82072|            Joven|
|  4|  David| 21|Los Angeles| 52764|            Joven|
|  5|    Bob| 53|   New York| 63448|            Mayor|
|  6|    Bob| 50|    Chicago| 70690|            Mayor|
|  7|  Alice| 20|   New York| 73682|            Joven|
|  8|  David| 33|    Houston| 88183|           Adulto|
|  9|Charlie| 26|    Houston| 42488|            Joven|
| 10|  David| 34|    Chicago| 87400|           Adulto|
| 11|  Alice| 57|    Chicago| 69692|            Mayor|
| 12|  Alice| 44|Los Angeles| 52611|           Adulto|
| 13|    Bob| 53|    Houston| 69018|            Mayor|
| 14|  David| 57|    Chicago| 66389|            Mayor|
| 15|    Bob| 28|    Chicago| 71627|            Joven|
| 16|  David| 37|   New York| 38964|           Adulto|
| 17|  Alice| 52|    Chicago| 31275|            Mayor|
| 18|    Bob| 44|   New York| 56190|           Adulto|
| 19|    Bob| 48|Los Angeles| 51606|           Adulto|
| 20|Charlie| 56|    Chicago| 89405|            Mayor|
+---+-------+---+-----------+------+-----------------+
only showing top 20 rows

In [106]:
spark.udf.register("edades_udf_sql", categorias_edades, StringType())

categorias_sql = spark.sql(""" SELECT *, edades_udf_sql(age) as age_category FROM personas """)
categorias_sql.show()

+---+-------+---+-----------+------+------------+
| id|   name|age|       city|salary|age_category|
+---+-------+---+-----------+------+------------+
|  1|  Alice| 45|Los Angeles| 98205|      Adulto|
|  2|Charlie| 35|    Houston| 90582|      Adulto|
|  3|    Bob| 28|    Chicago| 82072|       Joven|
|  4|  David| 21|Los Angeles| 52764|       Joven|
|  5|    Bob| 53|   New York| 63448|       Mayor|
|  6|    Bob| 50|    Chicago| 70690|       Mayor|
|  7|  Alice| 20|   New York| 73682|       Joven|
|  8|  David| 33|    Houston| 88183|      Adulto|
|  9|Charlie| 26|    Houston| 42488|       Joven|
| 10|  David| 34|    Chicago| 87400|      Adulto|
| 11|  Alice| 57|    Chicago| 69692|       Mayor|
| 12|  Alice| 44|Los Angeles| 52611|      Adulto|
| 13|    Bob| 53|    Houston| 69018|       Mayor|
| 14|  David| 57|    Chicago| 66389|       Mayor|
| 15|    Bob| 28|    Chicago| 71627|       Joven|
| 16|  David| 37|   New York| 38964|      Adulto|
| 17|  Alice| 52|    Chicago| 31275|       Mayor|
| 18|    Bob| 44|   New York| 56190|      Adulto|
| 19|    Bob| 48|Los Angeles| 51606|      Adulto|
| 20|Charlie| 56|    Chicago| 89405|       Mayor|
+---+-------+---+-----------+------+------------+
only showing top 20 rows

M谩s info sobre spark.udf.register:

Ejercicio 20: Guardado de Resultados
Guarda los resultados de cualquier consulta en un nuevo archivo Parquet.
Realiza lo mismo utilizando SQL.

In [107]:
parquet_file = categorias_edades_df.write.parquet("./data/parquet_personas.parquet")

In [108]:
parquet_sql = categorias_sql.write.parquet("./data/edades.parquet")